In [52]:
#Setup
import pandas as pd
from pathlib import Path

load_school_data = Path("Resources/schools_complete.csv")
load_student_data = Path("Resources/students_complete.csv")

#Read into Data Frames
school_data_df = pd.read_csv(load_school_data)
student_data_df = pd.read_csv(load_student_data)

In [53]:
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [54]:
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [100]:
#Merge both data sets
school_student_df = pd.merge(school_data, student_data, how="left", on=["school_name", "school_name"])
school_student_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [56]:
#Total unique school
unique_schools=school_student_df['school_name'].nunique()
unique_schools

15

In [183]:
#Total Students
total_students=school_student_df['student_name'].count()
total_students

39170

In [155]:
#total_budget
overall_budget=school_student_df.groupby(['school_name'])['budget'].mean()
combined_budget = overall_budget.sum()
combined_budget

24649428.0

In [58]:
#Math Average
math_average = school_student_df['math_score'].mean()
math_average

78.98537145774827

In [59]:
#Reading Average
reading_average = school_student_df['reading_score'].mean()
reading_average

81.87784018381414

In [178]:
#math score passing
math_passing = school_student_df['math_score'].apply(lambda x: 1 if x >=70 else 0).sum()
math_passing_rate = (math_passing / total_students)*100
math_passing_rate

89.77533241632278

In [180]:
#reading score passing
reading_passing = school_student_df['reading_score'].apply(lambda x: 1 if x >=70 else 0).sum()
reading_passing_rate = (reading_passing / total_students)*100
reading_average

81.87784018381414

In [191]:
#DataFrame
district_summary = pd.DataFrame({"Schools": [unique_schools], "Total Students": [total_students], "Total Budget": [combined_budget],
                                "Average Math Score": [math_average], "Average Reading Score": [reading_average],
                                "Math % Passing": [math_passing_rate], "Reading % Passing": [reading_average], })
district_summary

,Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Math % Passing,Reading % Passing
0,15,39170,24649428.0,78.985371,81.87784,89.775332,81.87784

School Summary

In [262]:
#School Types
school_types = school_student_df.groupby(['school_name'])['type'].value_counts()
school_types

school_name            type
Bailey High School     District    4976
Cabrera High School    Charter     1858
Figueroa High School   District    2949
Ford High School       District    2739
Griffin High School    Charter     1468
Hernandez High School  District    4635
Holden High School     Charter      427
Huang High School      District    2917
Johnson High School    District    4761
Pena High School       Charter      962
Rodriguez High School  District    3999
Shelton High School    Charter     1761
Thomas High School     Charter     1635
Wilson High School     Charter     2283
Wright High School     Charter     1800
Name: count, dtype: int64

In [219]:
#Total Students
total_students = school_student_df['school_name'].value_counts()
total_students

school_name
Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: count, dtype: int64

In [212]:
#School Budgets
school_budgets = school_student_df.groupby(['school_name'])['budget'].mean()
school_budgets

school_name
Bailey High School       3124928.0
Cabrera High School      1081356.0
Figueroa High School     1884411.0
Ford High School         1763916.0
Griffin High School       917500.0
Hernandez High School    3022020.0
Holden High School        248087.0
Huang High School        1910635.0
Johnson High School      3094650.0
Pena High School          585858.0
Rodriguez High School    2547363.0
Shelton High School      1056600.0
Thomas High School       1043130.0
Wilson High School       1319574.0
Wright High School       1049400.0
Name: budget, dtype: float64

In [213]:
#per student budget
per_student_budget = school_budgets/total_students
per_student_budget

school_name
Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [214]:
#School average math passing 
school_average_math = school_student_df.groupby(['school_name'])['math_score'].mean()
school_average_math

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [215]:
#School average reading passing
school_average_reading = school_student_df.groupby(['school_name'])['reading_score'].mean()
school_average_reading

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [243]:
#DataFrame

In [260]:
#Math Scores By Grade
math_by_grade = school_student_df.groupby(['grade'])['math_score'].mean()
math_by_grade

grade
10th    78.941483
11th    79.083548
12th    78.993164
9th     78.935659
Name: math_score, dtype: float64

In [261]:
#Reading Scores By Grade
reading_by_grade = school_student_df.groupby(['grade'])['reading_score'].mean()
reading_by_grade

grade
10th    81.874410
11th    81.885714
12th    81.819851
9th     81.914358
Name: reading_score, dtype: float64